In [1]:
from data_extraction import total_queries

In [2]:
df = total_queries(4)

In [3]:
df

   FK_student_nick  total
0       aarriagada      3
1          cduarte     41
2         abastian     26
3       ocontreras     11
4         gcurguan      9
5           mcarep      1
6        eespinoza     16
7         gandrade      2
8       jfernandez     16
9          bcortes     32
10    nguentalican      6
11          dhofer      6
12       mescobarp      2
13      chenriquez      3
14         lguzman     10
15          jgomez      7
16         mcatril     19
17       fcastillo     11
18      marriagada     30
19        nhuaquil      7
20         mgatica     30
21        rfuentes      4
22        jbarriap      7
23       mgallardo     10
24        ahidalgo      4
25     ehernandesp      1
26       jgonzalez     10
27         scortez     16
28       falvarado      2
29          aduque      3

In [4]:
df.describe()

           total
count  30.000000
mean   11.500000
std    10.598471
min     1.000000
25%     3.250000
50%     8.000000
75%    16.000000
max    41.000000

In [5]:
df[df['total']>=8].count()

FK_student_nick    15
total              15
dtype: int64

In [6]:
df_t = total_queries(4, unique=True)

In [7]:
df_t.describe()

           total
count  30.000000
mean    5.300000
std     3.554017
min     1.000000
25%     3.000000
50%     5.000000
75%     6.750000
max    15.000000

In [8]:
df_t[df_t['total']>=5].count()

FK_student_nick    16
total              16
dtype: int64

In [9]:
import pandas as pd

In [10]:
from recommendation import corpus_builder

In [11]:
sentences_1 = corpus_builder(challenge_id=4, maxq=1, sentences=True)
sentences_2 = corpus_builder(challenge_id=4, maxq=2, sentences=True)
sentences_3 = corpus_builder(challenge_id=4, maxq=3, sentences=True)

C:\Users\Marcelo\Desktop\recomendacion_de_terminos\filtering.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_data['snippet'] = filtered_data['snippet'].map(lambda text: BeautifulSoup(text, 'html.parser').get_text())

In [12]:
sentences_5 = corpus_builder(challenge_id=4, maxq=5, sentences=True)

In [13]:
display(sum([len(word) for word in sentences_5]), len(sentences_5)) #total palabras, total frases

75560

7908

In [14]:
# sentencias
wxsent = [len(word) for word in sentences_5]

wxs = pd.DataFrame(wxsent)

wxs.to_csv('wxsent_5.csv', header=['count'], index=False)

#wxsent

In [15]:
from collections import Counter
import numpy as np

In [16]:
wxsenstats_5 = Counter(x for xs in sentences_5 for x in set(xs))

In [17]:
import csv

In [18]:
with open('wxsenstats_5.csv','w') as f:
    w = csv.writer(f)
    w.writerows(wxsenstats_5.items())

In [19]:
df_sen1 = pd.read_csv('wxsenstats_1.csv', names=['word', 'count'], converters={'word' : str}, encoding='latin-1') #fix para null como palabra
df_sen2 = pd.read_csv('wxsenstats_2.csv', names=['word', 'count'], converters={'word' : str}, encoding='latin-1') #fix para null como palabra
df_sen3 = pd.read_csv('wxsenstats_3.csv', names=['word', 'count'], converters={'word' : str}, encoding='latin-1') #fix para null como palabra

In [20]:
df_sen4 = pd.read_csv('wxsenstats_4.csv', names=['word', 'count'], converters={'word' : str}, encoding='latin-1') #fix para null como palabra

In [21]:
df_sen5 = pd.read_csv('wxsenstats_5.csv', names=['word', 'count'], converters={'word' : str}, encoding='latin-1') #fix para null como palabra

In [22]:
df_sen5

            word  count
0      deportivo     20
1      construir    338
2           auto    607
3         dinero     34
4           cómo    311
...          ...    ...
17450   shopkins      1
17451       eggs      1
17452   dinosaur      1
17453       tmnt      1
17454     smiley      1

[17455 rows x 2 columns]

| maxq | Palabras | Frases | Palabras Unicas | Variacion porcentual (PU) |
|------|----------|--------|-----------------|----------------------|
| 1    | 27939    | 2798   | 8793            | 0                    |
| 2    | 46597    | 4828   | 12875           | 46.42329125440691%                    |
| 3    | 58285    | 5991   | 15019           | 16.65242718446602%                    |
| 4    | 66483    | 6918   | 16179           | 7.7235501697849385                    |
| 5    | 75560    | 7908   | 17455           | 7.886766796464554                    |

Variacion porcentual V2-V1/V1 * 100, Promedio 14064.200000 (DE = 3394.160161)

In [23]:
(17455- 16179)/16179*100

7.886766796464554

In [27]:
aux_l = [27939, 46597, 58285, 66483, 75560]

In [33]:
aux_l2 = [2798,4828, 5991, 6918, 7908]

In [34]:
aux = pd.DataFrame(aux_l)

In [36]:
auxx = pd.DataFrame(aux_l2)

In [37]:
auxx.describe()

                 0
count     5.000000
mean   5688.600000
std    1976.411344
min    2798.000000
25%    4828.000000
50%    5991.000000
75%    6918.000000
max    7908.000000

In [24]:
d = {'maxq': [1, 2, 3, 4 ,5], 'unique_w': [8793,12875,15019,16179,17455]}

In [25]:
aux_df = pd.DataFrame(data=d)

In [26]:
aux_df.describe()

           maxq      unique_w
count  5.000000      5.000000
mean   3.000000  14064.200000
std    1.581139   3394.160161
min    1.000000   8793.000000
25%    2.000000  12875.000000
50%    3.000000  15019.000000
75%    4.000000  16179.000000
max    5.000000  17455.000000